#+STARTUP: showall indent

file:../mpv/readme.org file:../espeak/readme.org file:../okular/readme.org
file:/home/thinkpad/Desktop/pdf_list_of_desktop.org

- 감탄의 연속이다.: file:../../app/emacs/eloud.org

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;더 좋은 방법을 발견했다. 늘 즐거운 마음으로 혁신에 도전하는 것이 새로운 방법을 발견하는 태도이다.
(shell-command-on-region (+ (line-beginning-position 2) 0) (line-end-position 2) ;;줄의 위치를 변경하는 구조
			"espeak -a 20" nil nil nil)  ;;  출력버퍼를 상정함
  hello world 반갑습니다 세상이여!

(shell-command-on-region (+ (line-beginning-position 2) 0) (line-end-position 2) 
			"espeak -a 20 -g 27 -s 120 -v other/la" nil nil nil)
religionis deorum immortalium fanorum aediumque sacrarum conlocatio, 

;; 출력버퍼를 상정함 상세화

:기억하고_누르고즉시관찰실험하라!:
#+begin_text org :최종목적은 process중단이 간략히 진행됨이 성공함.
app/emacs/process.org espeak, mpv diary (delete-process (get-process "while true espeak greek latin"))


#+end_text org
:end:

** english # 문장의 전달에 사용할 수 있는 방법으로 지정할 것.

#+NAME: test_txt
#+BEGIN_EXAMPLE
Type 
  t 
#+END_EXAMPLE


#+BEGIN_SRC sh :var a1=test_square(6) t=test_txt
echo "test_square $a1 헤더값으로 ()변수 기본값을 지정할 수 있었음에도 유의"
  echo "test_txt $t $함수의 기본을 정의한다."
#+END_SRC

#+RESULTS:
| 36   |
| Type |
| t    |
|      |

#+name: test_square
#+header: :var x=0
#+begin_src python
return x*x
#+end_src


